adamgreen/nrf52-SmartWatch/firmware/main.cpp
/*  Copyright (C) 2023  Adam Green (https://github.com/adamgreen)

    This program is free software; you can redistribute it and/or
    modify it under the terms of the GNU General Public License
    as published by the Free Software Foundation; either version 2
    of the License, or (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.
*/
// Beginnings of firmware for Bangle.js2 SmartWatch.
#include <stdarg.h>
#include <nrf_assert.h>
#include <nrf_delay.h>
#include <nrf_drv_gpiote.h>
#include <ble.h>
#include <ble_conn_state.h>
#include <ble_db_discovery.h>
#include <ble_hrs_c.h>
#include <ble_bas_c.h>
#include <app_timer.h>
#include <boards.h>
#include <fds.h>
#include <fstorage.h>
#include <peer_manager.h>
#include <nrf_ble_gatt.h>
#include <softdevice_handler.h>
#include <core/mri.h>
#include "SAADCScanner/SAADCScanner.h"
#include "ColorMemLCD/ColorMemLCD.h"


// Bangle.js2 analog battery voltage is connected to this pin through a 1/4 resistor divider.
static const uint8_t BATTERY_VOLTAGE_PIN = 3;

// Bangle.js2 connections to the transreflective LCD display.
static const uint8_t LCD_SCLK_PIN = 26;
static const uint8_t LCD_SI_PIN = 27;
static const uint8_t LCD_SCS_PIN = 5;
static const uint8_t LCD_EXTCOMIN_PIN = 6;
static const uint8_t LCD_DISP_PIN = 7;
static const uint8_t LCD_BACKLIGHT_PIN = 8;

// Bangle.js2 connection to the single button on the right side of the watch.
static const uint8_t BUTTON_PIN = 17;

// The SPIM peripheral instance to use for communicating with the LCD. Note that SPIM instances share the same
// resources as TWI (I2C).
#define LCD_SPI_INSTANCE    0

// The PWM peripheral instance to use for pulsing the LCD_EXTCOMIN LCD signal input.
#define LCD_PWM_INSTANCE    0


// ******************************************************************************************************
// BLE based Heart Rate Monitor Client code based on similar sample in Nordic's nRF5 SDK.
// ******************************************************************************************************
// The number of central and peripheral links to be supported are configured in sdk_config.h using the
// NRF_BLE_CENTRAL_LINK_COUNT and NRF_BLE_PERIPHERAL_LINK_COUNT macros.


// Value of the RTC1 PRESCALER register.
#define APP_TIMER_PRESCALER             0
// Size of timer operation queues.
#define APP_TIMER_OP_QUEUE_SIZE         2

// Security GAP parameters.
// Perform bonding.
#define SEC_PARAM_BOND                  1
// Man In The Middle protection required (applicable when display module is detected).
#define SEC_PARAM_MITM                  0
// LE Secure Connections not enabled.
#define SEC_PARAM_LESC                  0
// Keypress notifications not enabled.
#define SEC_PARAM_KEYPRESS              0
// Display I/O capabilities.
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE
// Out Of Band data not available.
#define SEC_PARAM_OOB                   0
/// Minimum encryption key size.
#define SEC_PARAM_MIN_KEY_SIZE          7
// Maximum encryption key size.
#define SEC_PARAM_MAX_KEY_SIZE          16

// Parameters for configuring how this application scans for nearby peripherals.
// Scan interval between 0x0004 and 0x4000 in 0.625ms units (2.5ms to 10.24s). 0xA0 is equal to 100 milliseconds.
// The central device will switch between advertising channels at this period.
#define SCAN_INTERVAL           0x00A0
// Scan window between 0x0004 and 0x4000 in 0.625ms units (2.5ms to 10.24s). 0x50 is equal to 50 milliseconds.
// The central device will actively scan a single advertising channel for this amount of time.
// Must be <= SCAN_INTERVAL. No scanning is performed for (SCAN_INTERVAL - SCAN_WINDOW) amount of time.
#define SCAN_WINDOW             0x0050

// Timings for how often peripheral and central should communicate over the link. The shorter the interval, the lower
// the link latency but at the cost of higher power usage.
// Apple's Accessory Design Guidelines places some extra constraints on these parameters:
// * Peripheral Latency of up to 30 connection intervals.
// * Supervision Timeout from 2 seconds to 6 seconds.
// * Interval Min of at least 15 ms.
// * Interval Min is a multiple of 15 ms.
// * One of the following:
//   * Interval Max at least 15 ms greater than Interval Min.
//    * Interval Max and Interval Min both set to 15 ms.
// * Interval Max * (Peripheral Latency + 1) of 2 seconds or less.
// * Supervision Timeout greater than Interval Max * (Peripheral Latency + 1) * 3.
// Minimum acceptable connection interval in ms (7.5 ms is smallest allowed). Connection interval uses 1.25 ms units.
#define MIN_CONNECTION_INTERVAL     MSEC_TO_UNITS(7.5, UNIT_1_25_MS)
// Maximum acceptable connection interval in ms. Connection interval uses 1.25 ms units.
#define MAX_CONNECTION_INTERVAL     MSEC_TO_UNITS(30, UNIT_1_25_MS)
// The number of the connection interval events that the peripheral can ignore before response is required.
#define SLAVE_LATENCY               0
// Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units.
#define SUPERVISION_TIMEOUT         MSEC_TO_UNITS(4000, UNIT_10_MS)


// Structure used to pass variable length data buffers into parseAdvertisementData().
typedef struct
{
    uint8_t* pData;
    uint16_t dataLength;
} SizedData;


// Analog to digital converter object used to read watch battery voltage.
static SAADCScanner         g_adc(NRF_SAADC_RESOLUTION_12BIT, false, _PRIO_APP_LOWEST);

// Battery voltage is read using this ADC channel.
SAADCScanner::Channel* g_pBatteryVoltageChannel = NULL;

// LCD display.
static const nrf_drv_spi_t  g_lcdSpiInstance = NRF_DRV_SPI_INSTANCE(LCD_SPI_INSTANCE);
static nrf_drv_pwm_t        g_lcdPwmInstance = NRF_DRV_PWM_INSTANCE(LCD_PWM_INSTANCE);
ColorMemLCD                 g_lcd(&g_lcdSpiInstance, &g_lcdPwmInstance,
                                  LCD_SCLK_PIN, LCD_SI_PIN, LCD_SCS_PIN,
                                  LCD_EXTCOMIN_PIN, LCD_DISP_PIN, LCD_BACKLIGHT_PIN);

// Globals used to communicate state between Heart Rate Monitor (hrm) and main loop.
static volatile bool        g_isHrmConnected = false;
static volatile uint32_t    g_heartRate = 0;

// Global BLE modules.
static ble_db_discovery_t   g_bleDbDiscovery;
static ble_hrs_c_t          g_bleHeartRateClient;
static ble_bas_c_t          g_bleBatteryClient;
static ble_gap_scan_params_t g_bleScanParameters;
static nrf_ble_gatt_t       g_bleGatt;

// Globals to track state within application's BLE stack.
static bool                 g_isWhitelistDisabled;
static bool                 g_isFlashAccessInProgress;

// If first call to ble_db_discovery_start() fails when connection is first made, then retry it later.
static bool                 g_retryDbDiscovery;
static uint16_t             g_bleConnectionToRetryDbDiscovery = BLE_CONN_HANDLE_INVALID;

// Connection timing parameters requested for BLE connection.
static const ble_gap_conn_params_t g_bleConnectionParameters =
{
    (uint16_t)MIN_CONNECTION_INTERVAL,
    (uint16_t)MAX_CONNECTION_INTERVAL,
    (uint16_t)SLAVE_LATENCY,
    (uint16_t)SUPERVISION_TIMEOUT
};

// When scanning for a peripheral to which a connection should be made, you can use one of 3 methods to find a match
// based on the data advertised by peripherals in the vicinity of this BLE central device:
// 1. The name of the Heart Rate Monitor to which a connection should be made.
//     Empty string if don't want to search by name.
static const char g_targetPeripheralName[] = "";
// 2. A specific device address.
//    Set g_useTargetPeripheralAddress to true if you want to use the address in g_targetPeripheralAddress.
static bool                 g_useTargetPeripheralAddress = false;
static const ble_gap_addr_t g_targetPeripheralAddress =
{
    // Possible values for addr_type:
    //   BLE_GAP_ADDR_TYPE_PUBLIC,
    //   BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
    //   BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,
    //   BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE.
    .addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
    .addr      = {0x8D, 0xFE, 0x23, 0x86, 0x77, 0xD9}
};
// 3. The UUID of the BLE Heart Rate Service.
#define TARGET_UUID         BLE_UUID_HEART_RATE_SERVICE




// UNDONE: Temporary debug log output queue.
static char              g_logBuffer[32*1024];
volatile static uint32_t g_logWrite = 0;

