adamgreen/nrf52-SmartWatch/firmware/main.cpp
static int logPrintF(const char* pFormat, ...)
{
    // First see how many bytes are needed for this printf() call.
    va_list vaList;
    va_start(vaList, pFormat);
    int bytesNeeded = vsnprintf(NULL, 0, pFormat, vaList);
    va_end(vaList);
    ASSERT ( bytesNeeded >= 0 );

    // Attempt to allocate enough bytes for this data in g_logBuffer using interlocked operations so that logging can
    // happen from multiple interrupt priorities at once.
    // - Add 1 for '\0' terminator.
    bytesNeeded += 1;
    uint32_t writeIndex = 0;
    uint32_t newIndex = 0;
    int storeFailed = 1;
    do
    {
        writeIndex = __LDREXW(&g_logWrite);
        newIndex = (writeIndex + bytesNeeded) % sizeof(g_logBuffer);
        storeFailed = __STREXW(newIndex, &g_logWrite);
    } while (storeFailed);

    if (newIndex > writeIndex)
    {
        // Can write to log in 1 contiguous write so do it directly from vsnprintf().
        va_start(vaList, pFormat);
        int bytesUsed = vsnprintf(&g_logBuffer[writeIndex], bytesNeeded, pFormat, vaList);
        va_end(vaList);
        ASSERT ( bytesUsed > 0 && bytesUsed == bytesNeeded-1 );
        return bytesUsed;
    }
    else
    {
        // The write has to wrap around in g_logBuffer so place it in a temporary contiguous buffer and then copy it
        // over byte by byte.
        char buffer[bytesNeeded];
        va_start(vaList, pFormat);
        int bytesUsed = vsnprintf(buffer, bytesNeeded, pFormat, vaList);
        va_end(vaList);
        ASSERT ( bytesUsed == bytesNeeded-1 );

        char* pCurr = &buffer[0];
        while (bytesUsed > 0)
        {
            g_logBuffer[writeIndex] = *pCurr++;
            writeIndex = (writeIndex + 1) % sizeof(g_logBuffer);
            bytesUsed--;
        }
        ASSERT ( writeIndex == newIndex );
        return bytesUsed;
    }
}





// UNDONE: Don't really want to go to sleep on Watch since I haven't made sure that I can wake it up yet.
#ifdef UNDONE
/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t errorCode = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(errorCode);

    // Prepare wakeup buttons.
    errorCode = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(errorCode);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    errorCode = sd_power_system_off();
    APP_ERROR_CHECK(errorCode);
}

/**@brief Function for disabling the use of whitelist for scanning.
 */
static void whitelist_disable(void)
{
    if (!g_isWhitelistDisabled)
    {
        logPrintF("Whitelist temporarily disabled.\n");
        g_isWhitelistDisabled = true;
        (void) sd_ble_gap_scan_stop();
        startScanningForHeartRateMonitor();
    }
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t errorCode;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            errorCode = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (errorCode != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(errorCode);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            whitelist_disable();
            break;

        default:
            break;
    }
}
#endif // UNDONE





// Forward Function Declarations
static void initLCD();
static void initBatteryVoltageReading();
static float readBatteryVoltage();
static void initButtonInterrupt();
static void handleButtonPress(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action);
static void initBLE(void);
static void dispatchBleEvents(ble_evt_t* pBleEvent);
static void handleBleEvent(ble_evt_t* pBleEvent);
static bool findPeerAddressInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport,
                                               const ble_gap_addr_t* pAddressOut);
static bool findNameInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport, const char* pNameToFind);
static uint32_t parseAdvertisementData(uint8_t type, SizedData* pAdvertisementData, SizedData* pTypeData);
static bool findUuidInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport, const uint16_t uuidToFind);
static uint16_t extractUUID16(const uint8_t* pSrc);
static void dispatchSysEvents(uint32_t sysEvent);
static void handleSysEvents(uint32_t sysEvent);
static void initPeerManager(bool eraseBonds);
static void handlePeerManagerEvents(pm_evt_t const* pGattEvent);
static void initGATT();
static void handleGattEvent(nrf_ble_gatt_t* pGATT, nrf_ble_gatt_evt_t* pGattEvent);
static void initDbDiscoveryModule();
static void handleDbDiscoveryEvent(ble_db_discovery_evt_t* pGattEvent);
static void initHeartRateService();
static void handleHeartRateServiceEvent(ble_hrs_c_t* pHeartRate, ble_hrs_c_evt_t* pHeartRateEvent);
static void initBatteryService();
static void handleBatteryServiceEvent(ble_bas_c_t * pBatteryService, ble_bas_c_evt_t * pBatteryServiceEvent);
static void startScanningForHeartRateMonitor();
static void loadWhitelist();
static void getPeerList(pm_peer_id_t* pPeers, uint32_t* peerCount);
static void sleepUntilNextEvent();
static void updateLCD();


int main(void)
{
    logPrintF("Starting up...\n");

    initLCD();
    initBatteryVoltageReading();
    initButtonInterrupt();

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
    initBLE();

    // UNDONE: Need way do this on the watch itself.
    bool eraseBonds = false;
    initPeerManager(eraseBonds);
    if (eraseBonds == true)
    {
        logPrintF("Bonds erased!\n");
    }

