adamgreen/nrf52-SmartWatch/firmware/main.cpp
    initGATT();
    initDbDiscoveryModule();
    initHeartRateService();
    initBatteryService();

    // UNDONE: Move into a timer.
    nrf_delay_ms(1);
    float batteryVoltage = readBatteryVoltage();
    logPrintF("Vbatt=%.1f\n", batteryVoltage + 0.05f);

    // Start scanning for peripherals and initiate connection with devices that advertise Heart Rate UUID.
    logPrintF("Heart Rate Example.\n");
    startScanningForHeartRateMonitor();

    for (;;)
    {
        sleepUntilNextEvent();
        updateLCD();
    }
}

static void initLCD()
{
    g_lcd.init();
    g_lcd.turnOn();
    g_lcd.setTextSize(2);
}

static void initBatteryVoltageReading()
{
    // Initialize the ADC object which scans all of the configured ADC channels manually.
    bool result = g_adc.init();
    ASSERT ( result );
    g_pBatteryVoltageChannel = g_adc.addChannel(BATTERY_VOLTAGE_PIN,
                                                NRF_SAADC_RESISTOR_DISABLED,
                                                NRF_SAADC_GAIN1_4,
                                                NRF_SAADC_REFERENCE_VDD4,
                                                NRF_SAADC_ACQTIME_3US,
                                                SAADC_LOWER_LIMIT_DISABLED,
                                                SAADC_UPPER_LIMIT_DISABLED,
                                                NULL);
    ASSERT ( g_pBatteryVoltageChannel != NULL );
    g_adc.startScanning();
}

static float readBatteryVoltage()
{
    // Read the battery voltage.
    ASSERT ( g_pBatteryVoltageChannel->getSampleCount() > 0 );
    SAADCScanner::Channel::Reading reading = g_pBatteryVoltageChannel->read();
    float batteryVoltage = 3.3f * 4.0f * reading.mean / 4095.0f;

    // Kick off the next ADC sampling cycle so that the sample is ready by the time it is needed.
    g_adc.startScanning();

    return batteryVoltage;
}

static void initButtonInterrupt()
{
    // Configure button on right side of watch to generate interrupt when it is pressed.
    nrf_drv_gpiote_in_config_t gpioteConfig =
    {
        .sense = NRF_GPIOTE_POLARITY_HITOLO,
        .pull = NRF_GPIO_PIN_PULLUP,
        .is_watcher = false,
        .hi_accuracy = false
    };
    uint32_t errorCode = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(errorCode);

    errorCode = nrf_drv_gpiote_in_init(BUTTON_PIN, &gpioteConfig, handleButtonPress);
    APP_ERROR_CHECK(errorCode);

    nrf_drv_gpiote_in_event_enable(BUTTON_PIN, true);
}

static void handleButtonPress(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    // UNDONE: Should probably debounce this.
    if (g_lcd.isOn())
    {
        g_lcd.turnOff();
    }
    else
    {
        g_lcd.turnOn();
    }
}

static void initBLE()
{
    uint32_t errorCode;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t bleEnableParams;
    errorCode = softdevice_enable_get_default_config(NRF_BLE_CENTRAL_LINK_COUNT,
                                                     NRF_BLE_PERIPHERAL_LINK_COUNT,
                                                     &bleEnableParams);
    APP_ERROR_CHECK(errorCode);

    // Verify that the start of RAM in nr52.ld leaves enough room for the softdevice when configured for the desired
    // number of central and peripheral links.
    CHECK_RAM_START_ADDR(NRF_BLE_CENTRAL_LINK_COUNT, NRF_BLE_PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    bleEnableParams.gatt_enable_params.att_mtu = NRF_BLE_GATT_MAX_MTU_SIZE;
#endif

    errorCode = softdevice_enable(&bleEnableParams);
    APP_ERROR_CHECK(errorCode);

    // Register with the SoftDevice handler module for BLE events.
    errorCode = softdevice_ble_evt_handler_set(dispatchBleEvents);
    APP_ERROR_CHECK(errorCode);

    // Register with the SoftDevice handler module for System events.
    errorCode = softdevice_sys_evt_handler_set(dispatchSysEvents);
    APP_ERROR_CHECK(errorCode);
}

static void dispatchBleEvents(ble_evt_t* pBleEvent)
{
    // Call ble_conn_state_on_ble_evt() before other functions that depend on ble_conn_state, like Peer Manager.
    ble_conn_state_on_ble_evt(pBleEvent);
    pm_on_ble_evt(pBleEvent);
    ble_db_discovery_on_ble_evt(&g_bleDbDiscovery, pBleEvent);
    ble_hrs_c_on_ble_evt(&g_bleHeartRateClient, pBleEvent);
    ble_bas_c_on_ble_evt(&g_bleBatteryClient, pBleEvent);
    nrf_ble_gatt_on_ble_evt(&g_bleGatt, pBleEvent);
    handleBleEvent(pBleEvent);
}

static void handleBleEvent(ble_evt_t* pBleEvent)
{
    uint32_t                errorCode;
    const ble_gap_evt_t   * pBleGapEvent = &pBleEvent->evt.gap_evt;

    switch (pBleEvent->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
        {
            logPrintF("Connected.\n");

            // Discover services supported by this peripheral.
            g_bleConnectionToRetryDbDiscovery = pBleEvent->evt.gap_evt.conn_handle;
            g_retryDbDiscovery = false;
            errorCode = ble_db_discovery_start(&g_bleDbDiscovery, g_bleConnectionToRetryDbDiscovery);
            if (errorCode == NRF_ERROR_BUSY)
            {
                logPrintF("ble_db_discovery_start() returned busy, will retry later.\n");
                g_retryDbDiscovery = true;
            }
            else
            {
                APP_ERROR_CHECK(errorCode);
            }

#ifdef UNDONE
            errorCode = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(errorCode);
#endif // UNDONE

            // If can still connect to more peripherals, then continue scanning for them.
            if (ble_conn_state_n_centrals() < NRF_BLE_CENTRAL_LINK_COUNT)
            {
                startScanningForHeartRateMonitor();
            }
        } break;

        case BLE_GAP_EVT_ADV_REPORT:
        {
            // UNDONE: The adv_report also has RSSI that can be used.
            //         Hopefully we can store the peer_addr along with RSSI, name, etc to display to user and
            //         call sd_ble_gap_connect() later.
            // Look at the advertised data from this peripheral to see if it one of the devices that we want to connect
            // to based on name, address, or supported UUIDs.
            bool isSupportedPeripheral = false;
            if (g_useTargetPeripheralAddress)
            {
                if (findPeerAddressInAdvertisementData(&pBleGapEvent->params.adv_report, &g_targetPeripheralAddress))
                {
                    logPrintF("Address match. Send connect request.\n");
                    isSupportedPeripheral = true;
                }
            }
            else if (strlen(g_targetPeripheralName) != 0)
            {
                if (findNameInAdvertisementData(&pBleGapEvent->params.adv_report, g_targetPeripheralName))
                {
                    isSupportedPeripheral = true;
                    logPrintF("Name match. Send connect request.\n");
                }
            }
            else
            {
                if (findUuidInAdvertisementData(&pBleGapEvent->params.adv_report, TARGET_UUID))
                {
                    isSupportedPeripheral = true;
                    logPrintF("UUID match. Send connect request.\n");
                }
            }

            // If we found a supported peripheral then try to connect to it.
            if (isSupportedPeripheral)
            {
                // Stop scanning.
                (void) sd_ble_gap_scan_stop();

