adamgreen/nrf52-SmartWatch/firmware/main.cpp
                #if (NRF_SD_BLE_API_VERSION == 2)
                    g_bleScanParameters.selective = 0;
                #endif
                #if (NRF_SD_BLE_API_VERSION == 3)
                    g_bleScanParameters.use_whitelist = 0;
                #endif

                // Initiate connection.
                errorCode = sd_ble_gap_connect(&pBleGapEvent->params.adv_report.peer_addr,
                                              &g_bleScanParameters,
                                              &g_bleConnectionParameters);

                g_isWhitelistDisabled = false;

                if (errorCode != NRF_SUCCESS)
                {
                    logPrintF("Connection Request Failed, reason %ld.\n", errorCode);
                }
            }
        } break; // BLE_GAP_EVT_ADV_REPORT

        case BLE_GAP_EVT_DISCONNECTED:
        {
            logPrintF("Disconnected, reason 0x%x.\n",
                         pBleEvent->evt.gap_evt.params.disconnected.reason);
            g_isHrmConnected = false;
#ifdef UNDONE
            errorCode = bsp_indication_set(BSP_INDICATE_IDLE);
            APP_ERROR_CHECK(errorCode);
#endif // UNDONE

            // Reset DB discovery structure.
            memset(&g_bleDbDiscovery, 0 , sizeof (g_bleDbDiscovery));

            // Can start scanning for a new device to connect to now that this one has disconnected.
            if (ble_conn_state_n_centrals() < NRF_BLE_CENTRAL_LINK_COUNT)
            {
                startScanningForHeartRateMonitor();
            }
        } break;

        case BLE_GAP_EVT_TIMEOUT:
        {
            if (pBleGapEvent->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
            {
                logPrintF("Scan timed out. Trying again...\n");
                startScanningForHeartRateMonitor();
            }
            else if (pBleGapEvent->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                logPrintF("Connection Request timed out.\n");
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            // Accepting parameters requested by peer.
            errorCode = sd_ble_gap_conn_param_update(pBleGapEvent->conn_handle,
                                                    &pBleGapEvent->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(errorCode);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            logPrintF("GATT Client Timeout.\n");
            errorCode = sd_ble_gap_disconnect(pBleEvent->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(errorCode);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            logPrintF("GATT Server Timeout.\n");
            errorCode = sd_ble_gap_disconnect(pBleEvent->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(errorCode);
            break;

        default:
            break;
    }
}

static bool findPeerAddressInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport,
                                               const ble_gap_addr_t* pAddressToFind)
{
    if (pAddressToFind->addr_type == pAdvertisementReport->peer_addr.addr_type)
    {
        if (memcmp(pAddressToFind->addr, pAdvertisementReport->peer_addr.addr, sizeof(pAdvertisementReport->peer_addr.addr)) == 0)
        {
            return true;
        }
    }
    return false;
}

static bool findNameInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport, const char* pNameToFind)
{
    SizedData   deviceName;

    // Initialize advertisement report for parsing
    SizedData advertisementData = { .pData = (uint8_t *)pAdvertisementReport->data,
                                    .dataLength = pAdvertisementReport->dlen };

    //search for advertising names
    ret_code_t errorCode = parseAdvertisementData(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME,
                                                  &advertisementData,
                                                  &deviceName);
    if (errorCode == NRF_SUCCESS)
    {
        if (memcmp(pNameToFind, deviceName.pData, deviceName.dataLength)== 0)
        {
            return true;
        }
    }
    else
    {
        // Look for the short local name if it was not found as complete
        errorCode = parseAdvertisementData(BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME,
                                           &advertisementData,
                                           &deviceName);
        if (errorCode != NRF_SUCCESS)
        {
            return false;
        }
        if (memcmp(g_targetPeripheralName, deviceName.pData, deviceName.dataLength )== 0)
        {
            return true;
        }
    }
    return false;
}

static uint32_t parseAdvertisementData(uint8_t type, SizedData* pAdvertisementData, SizedData* pTypeData)
{
    uint32_t  index = 0;
    uint8_t * p_data;

    p_data = pAdvertisementData->pData;

    while (index < pAdvertisementData->dataLength)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];

        if (field_type == type)
        {
            pTypeData->pData   = &p_data[index + 2];
            pTypeData->dataLength = field_length - 1;
            return NRF_SUCCESS;
        }
        index += field_length + 1;
    }
    return NRF_ERROR_NOT_FOUND;
}

static bool findUuidInAdvertisementData(const ble_gap_evt_adv_report_t* pAdvertisementReport, const uint16_t uuidToFind)
{
    uint32_t    errorCode;
    SizedData   advertisementData;
    SizedData   typeData;

    // Initialize advertisement report for parsing.
    advertisementData.pData = (uint8_t *)pAdvertisementReport->data;
    advertisementData.dataLength = pAdvertisementReport->dlen;

