adamgreen/nrf52-SmartWatch/firmware/main.cpp
static void handleGattEvent(nrf_ble_gatt_t* pGATT, nrf_ble_gatt_evt_t* pGattEvent)
{
    logPrintF("GATT MTU on link %d changed to %d\n",
                 pGattEvent->conn_handle,
                 pGattEvent->att_mtu_effective);
    if (g_retryDbDiscovery)
    {
        logPrintF("Retrying DB discovery.\n");

        // Discover peer's services.
        g_retryDbDiscovery = false;
        ret_code_t errorCode = ble_db_discovery_start(&g_bleDbDiscovery, g_bleConnectionToRetryDbDiscovery);
        if (errorCode == NRF_ERROR_BUSY)
        {
            logPrintF("ble_db_discovery_start() returned busy, will retry later.\n");
            g_retryDbDiscovery = true;
        }
        else
        {
            APP_ERROR_CHECK(errorCode);
        }
    }
}

static void initDbDiscoveryModule()
{
    uint32_t errorCode = ble_db_discovery_init(handleDbDiscoveryEvent);
    APP_ERROR_CHECK(errorCode);
}

static void handleDbDiscoveryEvent(ble_db_discovery_evt_t* pGattEvent)
{
    ble_hrs_on_db_disc_evt(&g_bleHeartRateClient, pGattEvent);
    ble_bas_on_db_disc_evt(&g_bleBatteryClient, pGattEvent);
}

static void initHeartRateService()
{
    ble_hrs_c_init_t hrsInitObject = { .evt_handler = handleHeartRateServiceEvent };

    uint32_t errorCode = ble_hrs_c_init(&g_bleHeartRateClient, &hrsInitObject);
    APP_ERROR_CHECK(errorCode);
}

static void handleHeartRateServiceEvent(ble_hrs_c_t* pHeartRate, ble_hrs_c_evt_t* pHeartRateEvent)
{
    uint32_t errorCode;

    switch (pHeartRateEvent->evt_type)
    {
        case BLE_HRS_C_EVT_DISCOVERY_COMPLETE:
            errorCode = ble_hrs_c_handles_assign(pHeartRate ,
                                                pHeartRateEvent->conn_handle,
                                                &pHeartRateEvent->params.peer_db);
            APP_ERROR_CHECK(errorCode);

            // Initiate bonding.
            errorCode = pm_conn_secure(pHeartRateEvent->conn_handle, false);
            if (errorCode != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(errorCode);
            }

            // Heart rate service discovered. Enable notification of Heart Rate Measurement.
            errorCode = ble_hrs_c_hrm_notif_enable(pHeartRate);
            APP_ERROR_CHECK(errorCode);

            logPrintF("Heart rate service discovered.\n");
            break;

        case BLE_HRS_C_EVT_HRM_NOTIFICATION:
        {
            // Save away this most recent heart rate measurement.
            g_isHrmConnected = true;
            g_heartRate = pHeartRateEvent->params.hrm.hr_value;
            logPrintF("Heart Rate = %d.\n", pHeartRateEvent->params.hrm.hr_value);
            for (int i = 0; i < pHeartRateEvent->params.hrm.rr_intervals_cnt; i++)
            {
                logPrintF("rr_interval = %d.\n", pHeartRateEvent->params.hrm.rr_intervals[i]);
            }
            break;
        }

        default:
            break;
    }
}

static void initBatteryService()
{
    ble_bas_c_init_t basInitObject = { .evt_handler = handleBatteryServiceEvent };

    uint32_t errorCode = ble_bas_c_init(&g_bleBatteryClient, &basInitObject);
    APP_ERROR_CHECK(errorCode);
}

static void handleBatteryServiceEvent(ble_bas_c_t* pBatteryService, ble_bas_c_evt_t* pBatteryServiceEvent)
{
    uint32_t errorCode;

    switch (pBatteryServiceEvent->evt_type)
    {
        case BLE_BAS_C_EVT_DISCOVERY_COMPLETE:
        {
            errorCode = ble_bas_c_handles_assign(pBatteryService,
                                                pBatteryServiceEvent->conn_handle,
                                                &pBatteryServiceEvent->params.bas_db);
            APP_ERROR_CHECK(errorCode);

            // Initiate bonding.
            errorCode = pm_conn_secure(pBatteryServiceEvent->conn_handle, false);
            if (errorCode != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(errorCode);
            }

            // Batttery service discovered. Enable notification of Battery Level.
            logPrintF("Battery Service discovered. Reading battery level.\n");

            errorCode = ble_bas_c_bl_read(pBatteryService);
            APP_ERROR_CHECK(errorCode);

            logPrintF("Enabling Battery Level Notification.\n");
            errorCode = ble_bas_c_bl_notif_enable(pBatteryService);
            APP_ERROR_CHECK(errorCode);

        } break;

        case BLE_BAS_C_EVT_BATT_NOTIFICATION:
            logPrintF("Battery Level received %d %%.\n", pBatteryServiceEvent->params.battery_level);
            break;

        case BLE_BAS_C_EVT_BATT_READ_RESP:
            logPrintF("Battery Level Read as %d %%.\n", pBatteryServiceEvent->params.battery_level);
            break;

        default:
            break;
    }
}

static void startScanningForHeartRateMonitor()
{
    // If there are any pending writes to FLASH, defer scanning until it completes.
    uint32_t isFlashBusy;
    (void) fs_queued_op_count_get(&isFlashBusy);
    if (isFlashBusy != 0)
    {
        g_isFlashAccessInProgress = true;
        return;
    }

    // Whitelist buffers.
    ble_gap_addr_t whitelistAddresses[8];
    ble_gap_irk_t  whitelistIRKs[8];
    memset(whitelistAddresses, 0x00, sizeof(whitelistAddresses));
    memset(whitelistIRKs,  0x00, sizeof(whitelistIRKs));

    uint32_t addressCount = (sizeof(whitelistAddresses) / sizeof(ble_gap_addr_t));
    uint32_t irkCount  = (sizeof(whitelistIRKs)  / sizeof(ble_gap_irk_t));

    #if (NRF_SD_BLE_API_VERSION == 2)

        ble_gap_addr_t* p_whitelist_addrs[8];
        ble_gap_irk_t*  p_whitelist_irks[8];

        for (uint32_t i = 0; i < 8; i++)
        {
            p_whitelist_addrs[i] = &whitelistAddresses[i];
            p_whitelist_irks[i]  = &whitelistIRKs[i];
        }

        ble_gap_whitelist_t whitelist =
        {
            .pp_addrs = p_whitelist_addrs,
            .pp_irks  = p_whitelist_irks,
        };

    #endif

    // Reload the whitelist and whitelist all peers.
    loadWhitelist();

    // Get the whitelist previously set using pm_whitelist_set().
    ret_code_t errorCode = pm_whitelist_get(whitelistAddresses, &addressCount,
                                            whitelistIRKs,  &irkCount);

    g_bleScanParameters.active   = 0;
    g_bleScanParameters.interval = SCAN_INTERVAL;
    g_bleScanParameters.window   = SCAN_WINDOW;

