adamgreen/nrf52-SmartWatch/firmware/main.cpp
    if (((addressCount == 0) && (irkCount == 0)) ||
        (g_isWhitelistDisabled))
    {
        // Don't use whitelist.
        #if (NRF_SD_BLE_API_VERSION == 2)
            g_bleScanParameters.selective   = 0;
            g_bleScanParameters.p_whitelist = NULL;
        #endif
        #if (NRF_SD_BLE_API_VERSION == 3)
            g_bleScanParameters.use_whitelist  = 0;
            g_bleScanParameters.adv_dir_report = 0;
        #endif
        g_bleScanParameters.timeout  = 0x0000; // No timeout.
    }
    else
    {
        // Use whitelist.
        #if (NRF_SD_BLE_API_VERSION == 2)
            whitelist.addr_count     = addressCount;
            whitelist.irk_count      = irkCount;
            g_bleScanParameters.selective   = 1;
            g_bleScanParameters.p_whitelist = &whitelist;
        #endif
        #if (NRF_SD_BLE_API_VERSION == 3)
            g_bleScanParameters.use_whitelist  = 1;
            g_bleScanParameters.adv_dir_report = 0;
        #endif
        g_bleScanParameters.timeout  = 0x001E; // 30 seconds.
    }

    logPrintF("Starting scan.\n");

    errorCode = sd_ble_gap_scan_start(&g_bleScanParameters);
    APP_ERROR_CHECK(errorCode);

#ifdef UNDONE
    errorCode = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(errorCode);
#endif // UNDONE
}

static void loadWhitelist()
{
    pm_peer_id_t peers[8];
    memset(peers, PM_PEER_ID_INVALID, sizeof(peers));
    uint32_t peerCount = (sizeof(peers) / sizeof(pm_peer_id_t));

    // Load all peers from flash and whitelist them.
    getPeerList(peers, &peerCount);

    ret_code_t errorCode = pm_whitelist_set(peers, peerCount);
    APP_ERROR_CHECK(errorCode);

    // Setup the device identities list.
    // Some SoftDevices do not support this feature.
    errorCode = pm_device_identities_list_set(peers, peerCount);
    if (errorCode != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(errorCode);
    }
}

static void getPeerList(pm_peer_id_t* pPeers, uint32_t* peerCount)
{
    uint32_t peersToCopy = (*peerCount < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ? *peerCount : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    *peerCount = 0;
    pm_peer_id_t peerID = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    while ((peerID != PM_PEER_ID_INVALID) && (peersToCopy--))
    {
        pPeers[(*peerCount)++] = peerID;
        peerID = pm_next_peer_id_get(peerID);
    }
}

static void sleepUntilNextEvent()
{
    uint32_t errorCode = sd_app_evt_wait();
    APP_ERROR_CHECK(errorCode);
}

static void updateLCD()
{
    g_lcd.waitForRefreshToComplete();
    g_lcd.clearDisplay();
    g_lcd.setTextSize(5);
    g_lcd.setCursor(50, 60);

    if (g_isHrmConnected)
    {
        g_lcd.printf("%u", g_heartRate);
    }
    else
    {
        g_lcd.printf("N/C");
    }
    g_lcd.refresh();
}



// Break into debugger if any errors/asserts are detected at runtime.
// This handler is called when an application error is encountered in BLE stack or application code.
extern "C" void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
    __debugbreak();
}

extern "C" void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    __debugbreak();
}


// Required to get C++ code to build.
extern "C" void __cxa_pure_virtual()
{
    ASSERT ( 0 );
    abort();
}
